# Exercise 02 -  OLAP Cubes - Slicing and Dicing

All the databases table in this demo are based on public database samples and transformations
- `Sakila` is a sample database created by `MySql` [Link](https://dev.mysql.com/doc/sakila/en/sakila-structure.html)
- The postgresql version of it is called `Pagila` [Link](https://github.com/devrimgunduz/pagila)
- The facts and dimension tables design is based on O'Reilly's public dimensional modelling tutorial schema [Link](http://archive.oreilly.com/oreillyschool/courses/dba3/index.html)

Start by creating and connecting to the database by running the cells below.

In [1]:
!PGPASSWORD=student createdb -h 127.0.0.1 -U student pagila_star
!PGPASSWORD=student psql -q -h 127.0.0.1 -U student -d pagila_star -f Data/pagila-star.sql

 set_config
------------

(1 row)

 setval
--------
    200
(1 row)

 setval
--------
    605
(1 row)

 setval
--------
     16
(1 row)

 setval
--------
    600
(1 row)

 setval
--------
    109
(1 row)

 setval
--------
    599
(1 row)

 setval
--------
      1
(1 row)

 setval
--------
      1
(1 row)

 setval
--------
      1
(1 row)

 setval
--------
      1
(1 row)

 setval
--------
  16049
(1 row)

 setval
--------
   1000
(1 row)

 setval
--------
   4581
(1 row)

 setval
--------
      6
(1 row)

 setval
--------
  32098
(1 row)

 setval
--------
  16049
(1 row)

 setval
--------
      2
(1 row)

 setval
--------
      2
(1 row)

### Connect to the local database where Pagila is loaded

In [2]:
import sql
%load_ext sql

DB_ENDPOINT = "127.0.0.1"
DB = 'pagila_star'
DB_USER = 'student'
DB_PASSWORD = 'student'
DB_PORT = '5432'

# postgresql://username:password@host:port/database
conn_string = "postgresql://{}:{}@{}:{}/{}" \
                        .format(DB_USER, DB_PASSWORD, DB_ENDPOINT, DB_PORT, DB)

print(conn_string)
%sql $conn_string

postgresql://student:student@127.0.0.1:5432/pagila_star

'Connected: student@pagila_star'

### Star Schema

<img src="pagila-star.png" width="50%"/>

# Start with a simple cube
TODO: Write a query that calculates the revenue (sales_amount) by day, rating, and city. Remember to join with the appropriate dimension tables to replace the keys with the dimension labels. Sort by revenue in descending order and limit to the first 20 rows. The first few rows of your output should match the table below.

In [8]:
%%time
%%sql

SELECT t.day, m.rating, s.city, sum(f.sales_amount) as revenue
FROM factsales f 
JOIN dimdate t ON (f.date_key = t.date_key)
JOIN dimmovie m ON (f.movie_key = m.movie_key)
JOIN dimstore s ON (f.store_key = s.store_key)
GROUP BY t.day, m.rating, s.city
ORDER BY  revenue desc
LIMIT 20

 * postgresql://student:***@127.0.0.1:5432/pagila_star
20 rows affected.
CPU times: user 7.03 ms, sys: 0 ns, total: 7.03 ms
Wall time: 26.9 ms

[(30, 'PG-13', 'Lethbridge', Decimal('784.21')),
 (30, 'G', 'Lethbridge', Decimal('730.48')),
 (30, 'R', 'Lethbridge', Decimal('683.46')),
 (30, 'NC-17', 'Woodridge', Decimal('667.49')),
 (30, 'NC-17', 'Lethbridge', Decimal('646.51')),
 (30, 'PG-13', 'Woodridge', Decimal('635.48')),
 (30, 'PG', 'Woodridge', Decimal('593.57')),
 (30, 'G', 'Woodridge', Decimal('587.58')),
 (20, 'PG-13', 'Lethbridge', Decimal('538.93')),
 (30, 'PG', 'Lethbridge', Decimal('521.78')),
 (21, 'PG-13', 'Lethbridge', Decimal('499.92')),
 (30, 'R', 'Woodridge', Decimal('495.74')),
 (17, 'PG-13', 'Woodridge', Decimal('488.83')),
 (18, 'R', 'Woodridge', Decimal('472.95')),
 (18, 'PG-13', 'Lethbridge', Decimal('466.92')),
 (19, 'PG-13', 'Lethbridge', Decimal('465.87')),
 (19, 'NC-17', 'Woodridge', Decimal('456.98')),
 (28, 'PG-13', 'Lethbridge', Decimal('455.97')),
 (21, 'NC-17', 'Lethbridge', Decimal('451.95')),
 (18, 'NC-17', 'Lethbridge', Decimal('447.01'))]

<div class="p-Widget jp-RenderedHTMLCommon jp-RenderedHTML jp-mod-trusted jp-OutputArea-output jp-OutputArea-executeResult" data-mime-type="text/html"><table>
    <tbody><tr>
        <th>day</th>
        <th>rating</th>
        <th>city</th>
        <th>revenue</th>
    </tr>
    <tr>
        <td>30</td>
        <td>G</td>
        <td>San Bernardino</td>
        <td>24.97</td>
    </tr>
    <tr>
        <td>30</td>
        <td>NC-17</td>
        <td>Apeldoorn</td>
        <td>23.95</td>
    </tr>
    <tr>
        <td>21</td>
        <td>NC-17</td>
        <td>Belm</td>
        <td>22.97</td>
    </tr>
    <tr>
        <td>30</td>
        <td>PG-13</td>
        <td>Zanzibar</td>
        <td>21.97</td>
    </tr>
    <tr>
        <td>28</td>
        <td>R</td>
        <td>Mwanza</td>
        <td>21.97</td>
    </tr>
</tbody></table></div>

## Slicing

Slicing is the reduction of the dimensionality of a cube by 1 e.g. 3 dimensions to 2, fixing one of the dimensions to a single value. In the example above, we have a 3-dimensional cube on day, rating, and country.

TODO: Write a query that reduces the dimensionality of the above example by limiting the results to only include movies with a `rating` of "PG-13". Again, sort by revenue in descending order and limit to the first 20 rows. The first few rows of your output should match the table below.

In [6]:
%%time
%%sql

SELECT t.day, m.rating, s.city, sum(f.sales_amount) as revenue
FROM factsales f 
JOIN dimdate t ON (f.date_key = t.date_key)
JOIN dimmovie m ON (f.movie_key = m.movie_key)
JOIN dimstore s ON (f.store_key = s.store_key)
WHERE m.rating = 'PG-13'
GROUP BY t.day, m.rating, s.city
ORDER BY  revenue desc
LIMIT 20

 * postgresql://student:***@127.0.0.1:5432/pagila_star
20 rows affected.
CPU times: user 5.54 ms, sys: 0 ns, total: 5.54 ms
Wall time: 15.2 ms

[(30, 'PG-13', 'Lethbridge', Decimal('784.21')),
 (30, 'PG-13', 'Woodridge', Decimal('635.48')),
 (20, 'PG-13', 'Lethbridge', Decimal('538.93')),
 (21, 'PG-13', 'Lethbridge', Decimal('499.92')),
 (17, 'PG-13', 'Woodridge', Decimal('488.83')),
 (18, 'PG-13', 'Lethbridge', Decimal('466.92')),
 (19, 'PG-13', 'Lethbridge', Decimal('465.87')),
 (28, 'PG-13', 'Lethbridge', Decimal('455.97')),
 (27, 'PG-13', 'Woodridge', Decimal('444.90')),
 (19, 'PG-13', 'Woodridge', Decimal('430.01')),
 (18, 'PG-13', 'Woodridge', Decimal('428.93')),
 (29, 'PG-13', 'Lethbridge', Decimal('414.09')),
 (21, 'PG-13', 'Woodridge', Decimal('391.05')),
 (27, 'PG-13', 'Lethbridge', Decimal('374.14')),
 (28, 'PG-13', 'Woodridge', Decimal('368.12')),
 (17, 'PG-13', 'Lethbridge', Decimal('368.09')),
 (20, 'PG-13', 'Woodridge', Decimal('362.00')),
 (22, 'PG-13', 'Lethbridge', Decimal('347.18')),
 (29, 'PG-13', 'Woodridge', Decimal('326.18')),
 (1, 'PG-13', 'Lethbridge', Decimal('310.30'))]

<div class="p-Widget jp-RenderedHTMLCommon jp-RenderedHTML jp-mod-trusted jp-OutputArea-output jp-OutputArea-executeResult" data-mime-type="text/html"><table>
    <tbody><tr>
        <th>day</th>
        <th>rating</th>
        <th>city</th>
        <th>revenue</th>
    </tr>
    <tr>
        <td>30</td>
        <td>PG-13</td>
        <td>Zanzibar</td>
        <td>21.97</td>
    </tr>
    <tr>
        <td>28</td>
        <td>PG-13</td>
        <td>Dhaka</td>
        <td>19.97</td>
    </tr>
    <tr>
        <td>29</td>
        <td>PG-13</td>
        <td>Shimoga</td>
        <td>18.97</td>
    </tr>
    <tr>
        <td>30</td>
        <td>PG-13</td>
        <td>Osmaniye</td>
        <td>18.97</td>
    </tr>
    <tr>
        <td>21</td>
        <td>PG-13</td>
        <td>Asuncin</td>
        <td>18.95</td>
    </tr>
</tbody></table></div>

## Dicing
Dicing is creating a subcube with the same dimensionality but fewer values for  two or more dimensions. 

TODO: Write a query to create a subcube of the initial cube that includes moves with:
* ratings of PG or PG-13
* in the city of Bellevue or Lancaster
* day equal to 1, 15, or 30

The first few rows of your output should match the table below.

In [14]:
%%time
%%sql

SELECT t.day, m.rating, s.city, sum(f.sales_amount) as revenue
FROM factsales f 
JOIN dimdate t ON (f.date_key = t.date_key)
JOIN dimmovie m ON (f.movie_key = m.movie_key)
JOIN dimstore s ON (f.store_key = s.store_key)
WHERE m.rating in ('PG-13', 'PG') 
AND s.city in ('Lethbridge', 'Woodridge') 
AND t.day in ('1', '15', '30')
GROUP BY t.day, m.rating, s.city
ORDER BY  revenue desc
LIMIT 20

 * postgresql://student:***@127.0.0.1:5432/pagila_star
12 rows affected.
CPU times: user 6.27 ms, sys: 0 ns, total: 6.27 ms
Wall time: 12.6 ms

[(30, 'PG-13', 'Lethbridge', Decimal('784.21')),
 (30, 'PG-13', 'Woodridge', Decimal('635.48')),
 (30, 'PG', 'Woodridge', Decimal('593.57')),
 (30, 'PG', 'Lethbridge', Decimal('521.78')),
 (1, 'PG', 'Woodridge', Decimal('316.16')),
 (1, 'PG-13', 'Lethbridge', Decimal('310.30')),
 (1, 'PG-13', 'Woodridge', Decimal('306.30')),
 (1, 'PG', 'Lethbridge', Decimal('296.30')),
 (15, 'PG-13', 'Woodridge', Decimal('195.54')),
 (15, 'PG-13', 'Lethbridge', Decimal('151.61')),
 (15, 'PG', 'Lethbridge', Decimal('140.65')),
 (15, 'PG', 'Woodridge', Decimal('138.66'))]

<div class="p-Widget jp-RenderedHTMLCommon jp-RenderedHTML jp-mod-trusted jp-OutputArea-output jp-OutputArea-executeResult" data-mime-type="text/html"><table>
    <tbody><tr>
        <th>day</th>
        <th>rating</th>
        <th>city</th>
        <th>revenue</th>
    </tr>
    <tr>
        <td>30</td>
        <td>PG</td>
        <td>Lancaster</td>
        <td>12.98</td>
    </tr>
    <tr>
        <td>1</td>
        <td>PG-13</td>
        <td>Lancaster</td>
        <td>5.99</td>
    </tr>
    <tr>
        <td>30</td>
        <td>PG-13</td>
        <td>Bellevue</td>
        <td>3.99</td>
    </tr>
    <tr>
        <td>30</td>
        <td>PG-13</td>
        <td>Lancaster</td>
        <td>2.99</td>
    </tr>
    <tr>
        <td>15</td>
        <td>PG-13</td>
        <td>Bellevue</td>
        <td>1.98</td>
    </tr>
</tbody></table></div>